package com.example.gacha_tab;

import android.os.Bundle;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.Button;
import android.widget.RadioButton;
import android.widget.TextView;

import androidx.annotation.NonNull;
import androidx.annotation.Nullable;
import androidx.fragment.app.Fragment;

import java.util.Arrays;
import java.util.Collections;

public class dessert extends Fragment {
    private TextView mTextView;
    private RadioButton ra;
    private RadioButton rb;
    private RadioButton rc;

    private final String[] th = {   "ข้าวเหนียวมะม่วง", "ขนมชั้นดอกกุหลาบ", "เต้าส่วน", "กระท้อนลอยแก้ว", "ลูกตาลลอยแก้ว", "ฟักทองแกงบวด", "บัวลอยไข่หวาน", "บัวลอยเผือก", "ข้าวเหนียวแก้วอัญชัน", "ขนมโค", "กล้วยบวชชี",
            "ลูกเดือยเปียกทรงเครื่อง", "วุ้นกะทิใบเตย", "ลูกชุบ", "ลอดช่องน้ำกะทิ", "สาคูแคนตาลูปนมสด", "สาคูข้าวโพดมะพร้ามอ่อน", "สาคูน้ำกะทิ", "ถั่วเขียวต้มน้ำตาล", "ขนมเบื้อง", "ทับทิมกรอบ", "ขนมถ้วย", "ลอดช่องน้ำกะทิ",
            "ไอศกรีมกะทิมะพร้าว", "ครองแครงอัญชัน", "กะทิสดมะพร้าวอ่อน", "สังขยาฟักทอง", "ขนมชั้นใบเตย", "วุ้นผลไม้", "เฉาก๊วย", "ทับทิมกรอบ", "วุ้นกะทิ", "วุ้นใบเตยกะทิสด", "แตงไทยใส่น้ำกะทิ",
            "ขนมเปียกปูนกะทิสด"};
    private final String[] ab = {   "ช็อกบอล", "แบล็คแอนด์ไวท์แพนเค้ก", "บิงซูเมล่อน", "มัฟฟินเบอร์รี", "พิตาผลไม้สด", "พิซซ่าผลไม้", "คุกกี้นมข้นหวาน", "ชีสทาร์ตมะยงชิด", "ทาร์ตบราวนี", "ทาร์ตผลไม้", "ชีสเค้กมันม่วง", "ชีสเค้กซูเฟล",
            "วาฟเฟิลกล้วยช็อกโกแลต", "แพนเค้กกล้วยหอม", "พุดดิ้งกล้วยเนยถั่ว", "ชีสเค้กม้าลาย", "เค้กฝอยทองครีมสดมะพร้าวอ่อน", "ทาร์ตมะม่วง", "บราวนี่มัก", "พิซซ่าบราวนี", "เครปเค้กชาไทย", "เค้กช็อกโกแลตหน้านิ่ม",
            "ซินนามอนโรลล์", "เค้กมะพร้าวอ่อน", "ชูครีม", "เค้กช็อกโแลตลาวา", "เค้กสตรอว์เบอร์รี", "เลมอนเมอแรงก์ชีสเค้ก", "เค้กชาไทยหน้านิ่ม", "โทสต์สังขยามันม่วง", "คุกกี้ลาวากระทะร้อน", "ชอร์ตเค้กสตรอว์เบอร์รี", "ทาร์ตลำไย",
            "เค้กมันม่วง", "ทอฟฟี่เค้กเม็ดมะม่วง", "ชิฟฟ่อนใบเตย", "พันนาคอตตา", "บลูเบอรี่ชีสพาย", "พายเลมอน", "บานอฟฟี่", "ทีรามิสุ", "ชูครีม", "เค้กสตรอเบอรี่ครีมสด", "แครนเบอรี่ชีสเค้ก", "บลูเบอรี่ชีสเค้ก",
            "บราวนี่", "บราวนี่ชีสเค้ก", "เค้กชานม", "เครปเค้ก", "เครปมะพร้าวอ่อน", "เครปชาเขียว", "วอร์มช็อคโกแลตลาวา", "เวรี่ช็อคโกแลตเค้ก", "แมคคาดาเมียช็อคโกแลตเค้ก", "เฟรนช์ช็อคโกแลตเค้ก", "บราวนี่มะม่วงหินพานต์",
            "เค้กส้ม", "คุ้กกี้", "โดนัท", "พุดดิ้ง"};
    private final String[] all = {  "ข้าวเหนียวมะม่วง", "ขนมชั้นดอกกุหลาบ", "เต้าส่วน", "กระท้อนลอยแก้ว", "ลูกตาลลอยแก้ว", "ฟักทองแกงบวด", "บัวลอยไข่หวาน", "บัวลอยเผือก", "ข้าวเหนียวแก้วอัญชัน", "ขนมโค", "กล้วยบวชชี",
            "ลูกเดือยเปียกทรงเครื่อง", "วุ้นกะทิใบเตย", "ลูกชุบ", "ลอดช่องน้ำกะทิ", "สาคูแคนตาลูปนมสด", "สาคูข้าวโพดมะพร้ามอ่อน", "สาคูน้ำกะทิ", "ถั่วเขียวต้มน้ำตาล", "ขนมเบื้อง", "ทับทิมกรอบ", "ขนมถ้วย", "ลอดช่องน้ำกะทิ",
            "ไอศกรีมกะทิมะพร้าว", "ครองแครงอัญชัน", "กะทิสดมะพร้าวอ่อน", "สังขยาฟักทอง", "ขนมชั้นใบเตย", "วุ้นผลไม้", "เฉาก๊วย", "ทับทิมกรอบ", "วุ้นกะทิ", "วุ้นใบเตยกะทิสด", "แตงไทยใส่น้ำกะทิ",
            "ขนมเปียกปูนกะทิสด","ช็อกบอล", "แบล็คแอนด์ไวท์แพนเค้ก", "บิงซูเมล่อน", "มัฟฟินเบอร์รี", "พิตาผลไม้สด", "พิซซ่าผลไม้", "คุกกี้นมข้นหวาน", "ชีสทาร์ตมะยงชิด", "ทาร์ตบราวนี", "ทาร์ตผลไม้", "ชีสเค้กมันม่วง", "ชีสเค้กซูเฟล",
            "วาฟเฟิลกล้วยช็อกโกแลต", "แพนเค้กกล้วยหอม", "พุดดิ้งกล้วยเนยถั่ว", "ชีสเค้กม้าลาย", "เค้กฝอยทองครีมสดมะพร้าวอ่อน", "ทาร์ตมะม่วง", "บราวนี่มัก", "พิซซ่าบราวนี", "เครปเค้กชาไทย", "เค้กช็อกโกแลตหน้านิ่ม",
            "ซินนามอนโรลล์", "เค้กมะพร้าวอ่อน", "ชูครีม", "เค้กช็อกโแลตลาวา", "เค้กสตรอว์เบอร์รี", "เลมอนเมอแรงก์ชีสเค้ก", "เค้กชาไทยหน้านิ่ม", "โทสต์สังขยามันม่วง", "คุกกี้ลาวากระทะร้อน", "ชอร์ตเค้กสตรอว์เบอร์รี", "ทาร์ตลำไย",
            "เค้กมันม่วง", "ทอฟฟี่เค้กเม็ดมะม่วง", "ชิฟฟ่อนใบเตย", "พันนาคอตตา", "บลูเบอรี่ชีสพาย", "พายเลมอน", "บานอฟฟี่", "ทีรามิสุ", "ชูครีม", "เค้กสตรอเบอรี่ครีมสด", "แครนเบอรี่ชีสเค้ก", "บลูเบอรี่ชีสเค้ก",
            "บราวนี่", "บราวนี่ชีสเค้ก", "เค้กชานม", "เครปเค้ก", "เครปมะพร้าวอ่อน", "เครปชาเขียว", "วอร์มช็อคโกแลตลาวา", "เวรี่ช็อคโกแลตเค้ก", "แมคคาดาเมียช็อคโกแลตเค้ก", "เฟรนช์ช็อคโกแลตเค้ก", "บราวนี่มะม่วงหินพานต์",
            "เค้กส้ม", "คุ้กกี้", "โดนัท", "พุดดิ้ง"};

    @Nullable
    @Override
    public View onCreateView(@NonNull LayoutInflater inflater, @Nullable ViewGroup container, @Nullable Bundle savedInstanceState) {
        View v = inflater.inflate(R.layout.fragdessert, container, false);

        ra = v.findViewById(R.id.TH);
        rb = v.findViewById(R.id.AB);
        rc = v.findViewById(R.id.all);

        mTextView = v.findViewById(R.id.textView);
        Button mButton = v.findViewById(R.id.button);
        mButton.setOnClickListener(v1 -> {
            if (ra.isChecked())
                Random(0);
            else if (rb.isChecked())
                Random(1);
            else if (rc.isChecked())
                Random(2);
        });
        return v;
    }

    public void Random(int i) {
        if (i == 0) {
            Collections.shuffle(Arrays.asList(th));
            mTextView.setText(th[0]);
        } else if (i == 1) {
            Collections.shuffle(Arrays.asList(ab));
            mTextView.setText(ab[0]);
        } else {
            Collections.shuffle(Arrays.asList(all));
            mTextView.setText(all[0]);
        }
    }

}