package com.example.gacha_tab;

import static com.example.gacha_tab.R.drawable.frame1;
import static com.example.gacha_tab.R.drawable.nightbg;

import android.content.SharedPreferences;
import android.os.Bundle;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.Button;
import android.widget.LinearLayout;
import android.widget.RadioButton;
import android.widget.TextView;

import androidx.annotation.NonNull;
import androidx.annotation.Nullable;
import androidx.appcompat.app.AppCompatDelegate;
import androidx.fragment.app.Fragment;

import java.util.Arrays;
import java.util.Collections;

public class food extends Fragment{
    private TextView mTextView;
    private RadioButton ra;
    private RadioButton rb;
    private RadioButton rc;

    //*****************************************************************************************************************************************************************
    // ห้ามแตะต้องโดยไม่จำเป็น
    private final String[] alone = {    "ข้าวผัดปลากระป๋อง", "ผัดกระเพราไข่เยี่ยวม้า", "มะเขือม่วงผัดกะปิ", "ผัดผักแขนงหมูกรอบ", "ผัดยอดฟักแม้ว", "ผัดเผ็ดหมู", "ปลาหมึกผัดกระเทียมพริกไทย", "ผัดกระเฉดหมูกรอบ",
            "ผัดกระเพราไก่", "ผัดกระเพราเป็ด", "ผัดเผ็ดหมูป่า", "ผัดกระเพราปลาหมึก", "ผัดเผ็ดปลาดุก", "ผัดพริกแกงไก่มะละกอ", "ตับผัดพริกไทยดำ", "ไข่ขมิ้น", "ข้าวผัดน้ำพริกเผา", "ข้าวผัดหมูแดง",
            "ข้าวผัดหมูลิ้นจี่", "ข้าวผัดกุ้ง", "ข้าวผัดไข่", "ข้าวผัดปู", "ข้าวผัดอเมริกัน", "ข้าวผัดมันกุ้ง", "ข้าวผัดกุนเชียง", "ข้าวผัดผงกะหรี่ทะเล", "ข้าวผัดแกงเขียวหวาน", "ข้าวผัดมันกุ้ง", "ข้าวผัดปลาทูน้ำพริกกะปิ",
            "ข้าวผัดปลากระป๋อง", "ข้าวผัดกุนเชียง", "ข้าวผัดต้มยำกุ้ง", "ข้าวอบกุนเชียง", "โจ๊กปลาเก๋า", "ข้าวอบกุนเชียง", "ต้มยำกุ้งน้ำค้น", "แกงเขียวหวานลูกชิ้นปลากราย", "ต้มยำปลาช่อน", "แกงเขียวหวานหมู",
            "ต้มยำรวมมิตรทะเล", "ต้มยำไก่บ้าน", "ไข่พะโล้", "ต้มยำไข่เจียว", "ลาบปลาหมึก", "ยำหูหมู", "ยำหนวดปลาหมึก", "ยำเห็ดรวมเจ", "พล่ากุ้ง", "ข้าวยำ", "ส้มตำไทย", "ส้มตำถั่วฝักยาว",
            "ยำปลาแซลมอน", "ยำหมูกรอบ", "ก้อยไข่มดแดง", "ตำถั่วหมูกรอบ", "แหนมคลุก", "ตับหวาน", "พล่าหนวดปลาหมึก", "ยำสตรอว์เบอรี่กุ้งสด", "ส้มตำกรอบ", "ก้อยไข่มดแดง", "ยำดอกอัญชันหมูสับ", "ปลานิลลุยสวน",
            "ยำเนื้อปูอโวคาโด", "ปลาดุกฟูคั่วกลิ้ง", "ยำดอกขจรกุ้งสด", "ยำสะนัด", "ยำมะม่วง", "ยำไข่ดาว", "ยำมะเขือยาวเผากุ้งสด", "ยำไข่เจียวน้ำพริกเผา", "แหนมคลุก", "ข้าวมันส้มตำไทย", "ออส่วน",
            "ไข่เจียวกระเทียมดอง", "หมูทอดกะปิ", "ทอดมันกุ้ง", "ไข่ดาวลูกเขย", "กบทอดกระเทียมพริกไทย", "หอยทอด", "ไก่ทอดกระเทียมพริกไทย", "ไข่เจียวลูกท้อ", "ไข่เจียวหมูสับหน่อไม้", "ปีกไก่ทอดตะไคร้",
            "หมูสามชั้นทอดพริกแกง", "โดนัทกุ้ง", "หมูกรอบ", "ไก่ทอดหาดใหญ่", "ก๋วยเตี๋ยวหลอดกุ้ง", "ข้าวหมูแดง", "หูหมูแก้ว", "เสือร้องไห้", "ข้าวหน้าหมูเกาหลี", "บ๊ะจ่าง", "โซยหว่อ", "ข้าวหน้าไก่",
            "ข้าวมันไก่สิงค์โปร์", "ขาหมูพะโล้", "ข้าวหมูอบ", "ข้าวต้มปลามิโซะ", "กุ้งราดกระเทียมพริกไทย", "เทมปุระ", "กุ้งกระเบื้อง", "กุ้งพันอ้อย", "กุ้งพันตะไคร้", "ทอดมันกุ้ง", "ไข่เจียวโหระพากรอบ",
            "กระเพาะหมูตุ๋นพริกไทยดำ", "แกงรัญจวน", "หอยนางรมชุบแป้งทอด", "เนื้อสวรรค์", "ลาบเนื้อทอด", "ปากเป็ดทอด", "ปูม้าทอดกระเทียมพริกไทย", "ปูทอดกระเทียมพริกไทย", "เกี้ยวปูทอด", "ไข่ตุ๋น", "ไก่แช่เหล้า",
            "ไข่ตุ๋นนมสด", "ปลาเก๋าลวกจิ้ม", "ไก่นึ่งอีสาน", "หมกปลาซิว", "ข้าวมันไก่สิงคโปร์", "ไหลบัวผัดกุ้ง", "กุ้งผัดผงกะหรี่", "เมล่อนกุ้งผัดไข่", "กุ้งผัดไข่เค็ม", "ไข่คั่วกุ้ง", "ไชโป้วผัดไข่", "ไก่ย่างวิเชียรบุรี",
            "ปลาซาบะย่างซีอิ๋ว", "สเต็กฮัมบรูก", "ข้าวหมูแดง", "ห่อหมกทะเล", "ต้มแซปกระดูกอ่อน", "ซุปมะเขือเวียดนาม", "แกงเทโพหมู", "ไก่ตุ๋นโสมเกาหลี", "แกงหน่อไม้ใบย่างนาง", "ปลาทูต้มขมิ้น", "ต้มยำปลาช่อน",
            "แกงป่าปลาช่อน", "ต้มยำปลาทู", "แกงเห็ดฟางใส่ผักหวาน", "ต้มยำเห็ดรวม", "แกงเห็ดเผาะใส่ผักหวาน", "แกงส้มชะอมไข่", "แกงส้มชะอมไข่", "พะแนงเนื้อ", "ต้มจับฉ่าย", "แกงคั่วกะทิหอยแครง", "ทอดมันข้าวโพด",
            "ไก่อบเต้าเจี้ยว", "ปีกไก่ทอดน้ำแดง", "เส้นบุกผัดกิมจิ", "หมูม้วนอบซอส", "ซี่โครงหมูสามรส", "ข้าวผัดกิมจิ", "ปลาแซลมอนผัดพะโล้", "มะละกอผัดวุ้นเส้น", "ผัดถั่วงอกเต้าหู้หมูสับ", "ไก่ผัดถั่วลิสง", "ผัดเปรี้ยวหวานปลา"};
    private final String[] noodle = {   "บะหมี่สะโพกไก่อบซอสแดง", "บะหมี่ไก่ตุ๋นเห็ดหอม", "ต้มจืดหมี่สั่ว", "ก๋วยเตี๋ยวหมูสับ", "มาม่าต้มยำหมูสับ", "ยำหมี่ขาวรสแซบ", "ขนมจีนน้ำใส", "ขนมจีนน้ำเงี้ยว",
            "ขนมจีนน้ำพริก", "ขนมจีนซาวน้ำ", "ก๋วยเตี๋ยวเรืออยุธยา", "ยำวุ้นเส้นทะเล", "ขนมจีนน้ำพริกกุ้งสด", "ไก่ผัดเส้นบุกต้มยำแห้ง", "เส้นบุกผัดกิมจิ", "อูด้งสุกี้ยากี้เนื้อ",
            "บุ๋นบ่อ", "สปาเก็ตตี้ผัดขี้เมา", "ยำขนมจีน", "ตำข้าวปุ้น", "แกงเขียวหวานพาสต้า", "พาสต้าโอโคโนมิยากิ", "มาม่าหอยแมลงภู่ผัดฉ่า", "มาม่าราดหน้ากุ้ง", "ก๋วยจั๊บน้ำข้น",
            "ผัดสุกี้ทะเลแห้ง", "มาม่าต้มยำสไตล์เกาหลี", "ผัดหมี่ซั่ว", "มาม่ากุ้งอบชีส", "มาม่าต้มยำแห้งหมูสับ", "ราดหน้าเจ", "ผัดวุ้นเส้นมะละกอ", "บะหมี่แห้งผัดกระเพราหมูสับ",
            "ขนมจีนน้ำยาปู", "บะหมี่เป็ดอบซอสปักกิ่ง", "ผัดหมี่โคราช", "ราดหน้าแซลมอน", "สปาเก็ตตี้ผัดผงกะหรี่ไก่", "ราดหน้ายอดผัก", "ผัดซีอิ้ว", "ผัดกระเพราวุ้นเส้นหมูสับ",
            "หมี่กะทิ", "กุ้งอบวุ้นเส้น", "หมี่เนื้อ", "ก๋วยจั๊บญวน", "ข้าวเปียกเส้น", "ขนมจีนสลัดผักเวียดนาม", "ขนมจีนทรงเครื่อง", "พาสต้าผัดต้มยำไก่", "ก๋วยเตี๋ยวต้มยำ", "ผัดไทยกุ้งสด",
            "เส้นใหญ่ผัดขี้เมา", "ยากิโซบะ", "สปาเกตตี้ผัดพริกกระเทียม", "เส้นหมี่ไก่ผัดน้ำพริกเผา", "เมนูสปาเก็ตตี้ไส้กรอกผัดพริกแห้ง", "บะหมี่เนื้อน้ำพริกเผา", "มาม่าผัดกะเพราหมูสับ",
            "ข้าวซอยแกงเขียวหวานเนื้อ", "ผัดไทไชยา", "ขนมจีนผัดหอยลาย", "สปาเกตตี้คะน้าปลาเค็ม", "มาม่าผัดกะเพรา", "บะหมี่ผัดแฮมหมูฝอย", "สุกี้แห้ง",
            "กะเพราขนมจีน", "ก๋วยเตี๋ยวคั่วไก่", "ราเมงหมูเห็ดหอม", "ขนมจีนพะแนงกุ้ง", "ข้าวซอยซี่โครงหมูตุ๋น", "บะหมี่ไก่อบซอส", "เส้นจันท์ผัดเทริยากิ", "ก๋วยเตี๋ยวไก่ตุ๋น", "ก๋วยเตี๋ยวไก่ตุ๋นมะระ",
            "ก๋วยเตี๋ยวถังแตก", "ก๋วยเตี๋ยวเป็ด", "ก๋วยเตี๋ยวหมูเด้ง", "ก๋วยเตี๋ยวเรือเนื้อตุ๋นหม้อไฟ", "ก๋วยเตี๋ยวหมูสับ", "ก๋วยเตี๋ยวต้มยำ", "ก๋วยเตี๋ยวเย็นตาโฟ", "ก๋วยเตี๋ยวเห็ดหอมเจ",
            "บะหมี่หน้าหมูไข่ออนเซ็น", "ก๋วยเตี๋ยวลูกชิ้นน้ำใส", "วุ้นเส้นแบนเย็นตาโฟแห้ง" };
    private final  String[] all = {     "ข้าวผัดปลากระป๋อง", "ผัดกระเพราไข่เยี่ยวม้า", "มะเขือม่วงผัดกะปิ", "ผัดผักแขนงหมูกรอบ", "ผัดยอดฟักแม้ว", "ผัดเผ็ดหมู", "ปลาหมึกผัดกระเทียมพริกไทย", "ผัดกระเฉดหมูกรอบ",
            "ผัดกระเพราไก่", "ผัดกระเพราเป็ด", "ผัดเผ็ดหมูป่า", "ผัดกระเพราปลาหมึก", "ผัดเผ็ดปลาดุก", "ผัดพริกแกงไก่มะละกอ", "ตับผัดพริกไทยดำ", "ไข่ขมิ้น", "ข้าวผัดน้ำพริกเผา", "ข้าวผัดหมูแดง",
            "ข้าวผัดหมูลิ้นจี่", "ข้าวผัดกุ้ง", "ข้าวผัดไข่", "ข้าวผัดปู", "ข้าวผัดอเมริกัน", "ข้าวผัดมันกุ้ง", "ข้าวผัดกุนเชียง", "ข้าวผัดผงกะหรี่ทะเล", "ข้าวผัดแกงเขียวหวาน", "ข้าวผัดมันกุ้ง", "ข้าวผัดปลาทูน้ำพริกกะปิ",
            "ข้าวผัดปลากระป๋อง", "ข้าวผัดกุนเชียง", "ข้าวผัดต้มยำกุ้ง", "ข้าวอบกุนเชียง", "โจ๊กปลาเก๋า", "ข้าวอบกุนเชียง", "ต้มยำกุ้งน้ำค้น", "แกงเขียวหวานลูกชิ้นปลากราย", "ต้มยำปลาช่อน", "แกงเขียวหวานหมู",
            "ต้มยำรวมมิตรทะเล", "ต้มยำไก่บ้าน", "ไข่พะโล้", "ต้มยำไข่เจียว", "ลาบปลาหมึก", "ยำหูหมู", "ยำหนวดปลาหมึก", "ยำเห็ดรวมเจ", "พล่ากุ้ง", "ข้าวยำ", "ส้มตำไทย", "ส้มตำถั่วฝักยาว",
            "ยำปลาแซลมอน", "ยำหมูกรอบ", "ก้อยไข่มดแดง", "ตำถั่วหมูกรอบ", "แหนมคลุก", "ตับหวาน", "พล่าหนวดปลาหมึก", "ยำสตรอว์เบอรี่กุ้งสด", "ส้มตำกรอบ", "ก้อยไข่มดแดง", "ยำดอกอัญชันหมูสับ", "ปลานิลลุยสวน",
            "ยำเนื้อปูอโวคาโด", "ปลาดุกฟูคั่วกลิ้ง", "ยำดอกขจรกุ้งสด", "ยำสะนัด", "ยำมะม่วง", "ยำไข่ดาว", "ยำมะเขือยาวเผากุ้งสด", "ยำไข่เจียวน้ำพริกเผา", "แหนมคลุก", "ข้าวมันส้มตำไทย", "ออส่วน",
            "ไข่เจียวกระเทียมดอง", "หมูทอดกะปิ", "ทอดมันกุ้ง", "ไข่ดาวลูกเขย", "กบทอดกระเทียมพริกไทย", "หอยทอด", "ไก่ทอดกระเทียมพริกไทย", "ไข่เจียวลูกท้อ", "ไข่เจียวหมูสับหน่อไม้", "ปีกไก่ทอดตะไคร้",
            "หมูสามชั้นทอดพริกแกง", "โดนัทกุ้ง", "หมูกรอบ", "ไก่ทอดหาดใหญ่", "ก๋วยเตี๋ยวหลอดกุ้ง", "ข้าวหมูแดง", "หูหมูแก้ว", "เสือร้องไห้", "ข้าวหน้าหมูเกาหลี", "บ๊ะจ่าง", "โซยหว่อ", "ข้าวหน้าไก่",
            "ข้าวมันไก่สิงค์โปร์", "ขาหมูพะโล้", "ข้าวหมูอบ", "ข้าวต้มปลามิโซะ", "กุ้งราดกระเทียมพริกไทย", "เทมปุระ", "กุ้งกระเบื้อง", "กุ้งพันอ้อย", "กุ้งพันตะไคร้", "ทอดมันกุ้ง", "ไข่เจียวโหระพากรอบ",
            "กระเพาะหมูตุ๋นพริกไทยดำ", "แกงรัญจวน", "หอยนางรมชุบแป้งทอด", "เนื้อสวรรค์", "ลาบเนื้อทอด", "ปากเป็ดทอด", "ปูม้าทอดกระเทียมพริกไทย", "ปูทอดกระเทียมพริกไทย", "เกี้ยวปูทอด", "ไข่ตุ๋น", "ไก่แช่เหล้า",
            "ไข่ตุ๋นนมสด", "ปลาเก๋าลวกจิ้ม", "ไก่นึ่งอีสาน", "หมกปลาซิว", "ข้าวมันไก่สิงคโปร์", "ไหลบัวผัดกุ้ง", "กุ้งผัดผงกะหรี่", "เมล่อนกุ้งผัดไข่", "กุ้งผัดไข่เค็ม", "ไข่คั่วกุ้ง", "ไชโป้วผัดไข่", "ไก่ย่างวิเชียรบุรี",
            "ปลาซาบะย่างซีอิ๋ว", "สเต็กฮัมบรูก", "ข้าวหมูแดง", "ห่อหมกทะเล", "ต้มแซปกระดูกอ่อน", "ซุปมะเขือเวียดนาม", "แกงเทโพหมู", "ไก่ตุ๋นโสมเกาหลี", "แกงหน่อไม้ใบย่างนาง", "ปลาทูต้มขมิ้น", "ต้มยำปลาช่อน",
            "แกงป่าปลาช่อน", "ต้มยำปลาทู", "แกงเห็ดฟางใส่ผักหวาน", "ต้มยำเห็ดรวม", "แกงเห็ดเผาะใส่ผักหวาน", "แกงส้มชะอมไข่", "แกงส้มชะอมไข่", "พะแนงเนื้อ", "ต้มจับฉ่าย", "แกงคั่วกะทิหอยแครง", "ทอดมันข้าวโพด",
            "ไก่อบเต้าเจี้ยว", "ปีกไก่ทอดน้ำแดง", "เส้นบุกผัดกิมจิ", "หมูม้วนอบซอส", "ซี่โครงหมูสามรส", "ข้าวผัดกิมจิ", "ปลาแซลมอนผัดพะโล้", "มะละกอผัดวุ้นเส้น", "ผัดถั่วงอกเต้าหู้หมูสับ", "ไก่ผัดถั่วลิสง", "ผัดเปรี้ยวหวานปลา",
            "บะหมี่สะโพกไก่อบซอสแดง", "บะหมี่ไก่ตุ๋นเห็ดหอม", "ต้มจืดหมี่สั่ว", "ก๋วยเตี๋ยวหมูสับ", "มาม่าต้มยำหมูสับ", "ยำหมี่ขาวรสแซบ", "ขนมจีนน้ำใส", "ขนมจีนน้ำเงี้ยว",
            "ขนมจีนน้ำพริก", "ขนมจีนซาวน้ำ", "ก๋วยเตี๋ยวเรืออยุธยา", "ยำวุ้นเส้นทะเล", "ขนมจีนน้ำพริกกุ้งสด", "ไก่ผัดเส้นบุกต้มยำแห้ง", "เส้นบุกผัดกิมจิ", "อูด้งสุกี้ยากี้เนื้อ",
            "บุ๋นบ่อ", "สปาเก็ตตี้ผัดขี้เมา", "ยำขนมจีน", "ตำข้าวปุ้น", "แกงเขียวหวานพาสต้า", "พาสต้าโอโคโนมิยากิ", "มาม่าหอยแมลงภู่ผัดฉ่า", "มาม่าราดหน้ากุ้ง", "ก๋วยจั๊บน้ำข้น",
            "ผัดสุกี้ทะเลแห้ง", "มาม่าต้มยำสไตล์เกาหลี", "ผัดหมี่ซั่ว", "มาม่ากุ้งอบชีส", "มาม่าต้มยำแห้งหมูสับ", "ราดหน้าเจ", "ผัดวุ้นเส้นมะละกอ", "บะหมี่แห้งผัดกระเพราหมูสับ",
            "ขนมจีนน้ำยาปู", "บะหมี่เป็ดอบซอสปักกิ่ง", "ผัดหมี่โคราช", "ราดหน้าแซลมอน", "สปาเก็ตตี้ผัดผงกะหรี่ไก่", "ราดหน้ายอดผัก", "ผัดซีอิ้ว", "ผัดกระเพราวุ้นเส้นหมูสับ",
            "หมี่กะทิ", "กุ้งอบวุ้นเส้น", "หมี่เนื้อ", "ก๋วยจั๊บญวน", "ข้าวเปียกเส้น", "ขนมจีนสลัดผักเวียดนาม", "ขนมจีนทรงเครื่อง", "พาสต้าผัดต้มยำไก่", "ก๋วยเตี๋ยวต้มยำ", "ผัดไทยกุ้งสด",
            "เส้นใหญ่ผัดขี้เมา", "ยากิโซบะ", "สปาเกตตี้ผัดพริกกระเทียม", "เส้นหมี่ไก่ผัดน้ำพริกเผา", "เมนูสปาเก็ตตี้ไส้กรอกผัดพริกแห้ง", "บะหมี่เนื้อน้ำพริกเผา", "มาม่าผัดกะเพราหมูสับ",
            "ข้าวซอยแกงเขียวหวานเนื้อ", "ผัดไทไชยา", "ขนมจีนผัดหอยลาย", "สปาเกตตีกุ้งมะเขือเทศเชอร์รี", "สปาเกตตี้คะน้าปลาเค็ม", "มาม่าผัดกะเพรา", "บะหมี่ผัดแฮมหมูฝอย", "สุกี้แห้ง",
            "กะเพราขนมจีน", "ก๋วยเตี๋ยวคั่วไก่", "ราเมงหมูเห็ดหอม", "ขนมจีนพะแนงกุ้ง", "ข้าวซอยซี่โครงหมูตุ๋น", "บะหมี่ไก่อบซอส", "เส้นจันท์ผัดเทริยากิ", "ก๋วยเตี๋ยวไก่ตุ๋น", "ก๋วยเตี๋ยวไก่ตุ๋นมะระ",
            "ก๋วยเตี๋ยวถังแตก", "ก๋วยเตี๋ยวเป็ด", "ก๋วยเตี๋ยวหมูเด้ง", "ก๋วยเตี๋ยวเรือเนื้อตุ๋นหม้อไฟ", "ก๋วยเตี๋ยวหมูสับ", "ก๋วยเตี๋ยวต้มยำ", "ก๋วยเตี๋ยวเย็นตาโฟ", "ก๋วยเตี๋ยวเห็ดหอมเจ",
            "บะหมี่หน้าหมูไข่ออนเซ็น", "ก๋วยเตี๋ยวลูกชิ้นน้ำใส", "วุ้นเส้นแบนเย็นตาโฟแห้ง" };


    //***************************************************************************************************************************************************************************

    @Nullable
    @Override
    public View onCreateView(@NonNull LayoutInflater inflater, @Nullable ViewGroup container, @Nullable Bundle savedInstanceState) {
        View v = inflater.inflate(R.layout.fragfood, container, false);



        ra = v.findViewById(R.id.alone);
        rb = v.findViewById(R.id.noodle);
        rc = v.findViewById(R.id.AllF);

        mTextView = v.findViewById(R.id.textView);
        Button mButton = v.findViewById(R.id.button);
        mButton.setOnClickListener(v1 -> {
            if (ra.isChecked())
                Random(0);
            else if (rb.isChecked())
                Random(1);
            else if (rc.isChecked())
                Random(2);
        });

        return v;
    }

    public void Random(int i) {
        if(i == 0){
            Collections.shuffle(Arrays.asList(alone));
            mTextView.setText(alone[0]);
        }
        else if (i == 1){
            Collections.shuffle(Arrays.asList(noodle));
            mTextView.setText(noodle[0]);
        }
        else {
            Collections.shuffle(Arrays.asList(all));
            mTextView.setText(all[0]);
        }
    }


}






